-- phpMyAdmin SQL Dump
-- version 5.2.0
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1:3306
-- Время создания: Янв 18 2023 г., 22:49
-- Версия сервера: 5.7.39
-- Версия PHP: 7.3.33

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `php_project`
--

-- --------------------------------------------------------

--
-- Структура таблицы `admins`
--

CREATE TABLE `admins` (
  `admin_id` int(11) NOT NULL,
  `admin_name` varchar(250) NOT NULL,
  `admin_email` text NOT NULL,
  `admin_password` text NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Дамп данных таблицы `admins`
--

INSERT INTO `admins` (`admin_id`, `admin_name`, `admin_email`, `admin_password`) VALUES
(1, 'admin', 'admin@gmail.com', '827ccb0eea8a706c4c34a16891f84e7b');

-- --------------------------------------------------------

--
-- Структура таблицы `products`
--

CREATE TABLE `products` (
  `product_id` int(11) NOT NULL,
  `product_name` varchar(100) CHARACTER SET cp1251 COLLATE cp1251_ukrainian_ci NOT NULL,
  `product_category` varchar(100) NOT NULL,
  `product_description` varchar(255) CHARACTER SET cp1251 COLLATE cp1251_ukrainian_ci NOT NULL,
  `product_image` varchar(255) NOT NULL,
  `video` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- Дамп данных таблицы `products`
--

INSERT INTO `products` (`product_id`, `product_name`, `product_category`, `product_description`, `product_image`, `video`) VALUES
(1, 'Меню', 'film', 'У відкритому океані розташувався дивовижний острів. Побувати на ньому бажають туристи з усієї планети. Щоправда вабить їх не мальовнича природа чи кришталево чисті води. ', 'The Menu1.jpeg', 'https://www.youtube.com/embed/Kx55Rkynhtk'),
(2, 'Демонік', 'film', 'Надприродний хорор про нові технології, які приходять на допомогу екзорцистам. Дочці серійної вбивці належить заглянути у підсвідомість власної матері, щоб зрозуміти, що штовхнуло її на жорстокі злочини.', 'Demonic1.jpeg', 'https://www.youtube.com/embed/EYXLKC5xd7Q'),
(3, 'Аватар: Шлях води\r\n', 'film', 'Сюжет 2 частини розкаже нам про головних героїв — Джейка та Нейтирі, які встигли створити свою сім\'ю та старанно виховують дітей. Тепер вже велике сімейство приймає в свою родину ще одну дитину, яка народилася на військовій базі планети Пандора.', 'Avatar1.jpeg', 'https://www.youtube.com/embed/d9MyW72ELq0'),
(4, 'Люта нічка', 'film', 'Різдво час чарівництва та виконання бажань. Звичайна передсвяткова метушня: на ялинку повішена остання іграшка, на стіл поставлені смачні страви. Героїня фільму «Люта нічка» отримує у подарунок від батьків рацію.', 'Violent Night1.jpg', 'https://www.youtube.com/embed/a53e4HHnx_s'),
(5, 'Про долю', 'film', 'Гріффін зробив коханій пропозицію повінчатися, але та зненацька взяла паузу. У той же час гарний чоловік, з яким зустрічалася Марго, також попросив перерву. Тим часом героїня фільму «Про Долю» вже пообіцяла познайомити близьких ', 'About Fate1.jpg', 'https://www.youtube.com/embed/BVtN9rwoGpw'),
(6, 'Білий шум', 'film', 'Джон Гледні – працівник університету Коледж-на-Холмі. Герой фільму \"Білий шум\" захоплюється вивченням біографії Адольфа Гітлера. Для нього головним є баланс між роботою та сім\'єю.', 'White Noise1.jpg', 'https://www.youtube.com/embed/SgwKZAMx_gM'),
(7, 'Одрі', 'film', 'Творці документального творіння під назвою \"Одрі\" вирішили розповісти дивовижну біографію прославленої та улюбленої багатьма артистки на прізвище Хепберн, яка була для багатьох іконою стилю і прикладом для наслідування.', 'Audrey1.jpg', 'https://www.youtube.com/embed/DOY77nyd6fY'),
(8, 'Блідо-блакитне око', 'film', 'На початку ХІХ століття одному з університетів відбувається страшний випадок. Студент виявлений повішеним. Хоча тут цей факт недивний. Ніхто з місцевих детективів не береться за таку просту справу. Невдовзі з\'ясовується, що у покійного вирізане серце. ', 'The Pale Blue Eye1.jpg', 'https://www.youtube.com/embed/ddbL9jvg77w'),
(9, 'Проєкт «Адам»', 'film', 'Сюжет фантастичного фільму Проект «Адам» крутиться навколо Адама Ріда, який зовсім недавно втратив свого батька. Хлопчик залишився наодинці з почуттям туги та самотності.', 'The Adam Project1.jpg', 'https://www.youtube.com/embed/gpxUcIJ1tGs'),
(10, 'Кіт у чоботях 2: Останнє бажання', 'cartoons', 'Природа наділила його красою, хитрістю та неймовірною чарівністю. Він носить чорний капелюх та високі чоботи. Те, як він володіє шпагою і його невимовна відвага, завжди звертають на себе загальну увагу, а вороги втікають з поля битви. ', 'Puss in Boots The Last Wish1.jpeg', 'https://www.youtube.com/embed/tHb7WlgyaUc'),
(11, 'Як приборкати дракона 3 Прихований світ', 'cartoons', 'З того моменту, як люди та дракони вирішили жити окремо, минуло вже 10 років. Вони, як і раніше, друзі та союзники, просто роздільний спосіб життя безпечніший для обох сторін. За час для Гикавки і Беззубика багато що змінилося.', 'How to Train Your Dragon The Hidden World1.jpeg', 'https://www.youtube.com/embed/SkcucKDrbOI'),
(12, 'Енканто: Світ магії', 'cartoons', 'Мірабель Мадрігаль разом із сім\'єю живе в дивовижному місці під назвою Енканто, в чарівному будинку, захованому в горах Колумбії. Кожна дитина цієї сім\'ї нагороджувалась унікальним даром — суперсила або здатність зцілювати. ', 'Encanto1.jpg', 'https://www.youtube.com/embed/CaimKeDcudo'),
(13, 'Секрети домашніх тварин 2', 'cartoons', 'Події нової частини анімаційної стрічки продовжують розповідати про домашніх вихованців. У центрі сюжету опиняється Макс - пес, в домі якого проходять галасливі збори. ', 'The Secret Life of Pets 21.jpg', 'https://www.youtube.com/embed/mYocfuqu2A8'),
(14, 'Родина Адамсів', 'cartoons', 'Уявіть сім\'ю, в якій батько любить прогулянки під гуркіт грому і блиск грози, а для мами немає кольору привабливішого, ніж чорний. Діти весь вільний час проводять на кладовищі, граючи з кістками, а бабуся регулярно приймає отруту перед сном.', 'The Addams Family1.jpg', 'https://www.youtube.com/embed/F7Ug863S8dQ'),
(15, 'ВОЛЛ-І', 'cartoons', 'Дії фантастичного мультфільму від студії Walt Disney Pictures «ВОЛЛ-І» розгортаються в далекому майбутньому, коли Земля стала непридатна для життя і люди були змушені її залишити. Єдиний, хто залишився на планеті - це робот ВОЛЛ-І', 'WALL-E1.jpg', 'https://www.youtube.com/embed/CZ1CATNbXg0'),
(16, 'Людина-павук: Навколо всесвіту', 'cartoons', 'Мультфільм «Людина-павук: Навколо всесвіту» - нова і абсолютно унікальна картина, що показує головного героя Майлза Моралеза, який є супергероєм, та проживає у великому і шумному Нью-Йорку.', 'qwe1.jpeg', 'https://www.youtube.com/embed/g4Hbz2jLxvQ'),
(17, 'Нікчемний Я 2', 'cartoons', 'Всесвітньо відомий, великий і жахливий лиходій Грю практично відійшов від справ. Він все-таки усиновив трьох дочок і тепер, через якийсь час, перетворився в ласкавого і турботливого татуся.', 'Despicable Me 21.jpg', 'https://www.youtube.com/embed/yM9sKpQOuEw'),
(18, 'Дамер - Чудовисько: Історія Джеффрі Дамера ', 'serial', 'Події серіалу розгортаються у сімдесят восьмому році. Точніше, це лише початок історії. Уся серія злочинів Дамера Джеффрі тягнеться аж до дев\'яносто першого року минулого сторіччя.', 'Dahmer  Monster The Jeffrey Dahmer Story1.jpeg', 'https://www.youtube.com/embed/NVHHs-xllqo'),
(19, 'Венздей 1 сезон', 'serial', 'Сюжет серіалу будується навколо героїні, яку глядачі можуть чудово знати за знаменитою \"сімейкою Адамс\". Історія сконцентрується на Венздей, дівчині, яка нещодавно вступила до академії Невермор, де продовжує своє повсякденне навчання.', 'Wednesday 1 season1.jpg', 'https://www.youtube.com/embed/Di310WS8zLk'),
(20, 'Казино 1 сезон', 'serial', 'Серіал \"Казино\" пропонує поринути у нову історію, створену генієм режисерської справи з Південної Кореї, автора знаменитого бойовика \"Кримінальне місто\". Кан Юн Сон вкотре пропонує нам поринути в гостросюжетну круто закручену кримінальну історію. ', 'fdg1.jpeg', 'https://www.youtube.com/embed/pLyM5KaessI'),
(21, 'Базіка 1 сезон', 'serial', 'Навколо відбувається щось незрозуміле та по-справжньому дивне. Третьосортний адвокат випадково береться за справу, яка може миттєво підняти її в рейтингах і зробити найбажанішим експертом у юридичній сфері', 'Big Mouth 1 season1.jpg', 'https://www.youtube.com/embed/Z3OMssCwMjA'),
(22, 'Аліса в Ігрокраї / Аліса в Бордерленді 2 сезон', 'serial', 'З другим сезоном на екрани повертається історія, що розповідає про трьох приятелів, які виявляються якимось неймовірним чином у потойбіччі. ', 'Alice in Borderland 2 season1.jpg', 'https://www.youtube.com/embed/1ifgEQCevYc'),
(23, 'Вікінґи. Вальгалла 1 сезон', 'serial', 'Серіал охоплює цілу епоху, що сталася в ранньому середньовіччі, коли вікінги активно відвідували острови Великобританії з метою захоплення нових земель та пограбування. Щоправда, окрім іншого тут сталося чимало інших цікавих подій', 'sdf1.jpeg', 'https://www.youtube.com/embed/Yi4YnwFT7Gk'),
(24, 'Людина-бензопила 1 сезон', 'serial', 'Головний персонаж Дендзі завжди мріяв про спокійне і розмірене життя, яке б приносило задоволення. Ці мрії мали втілитись у житті з коханою дівчиною. Однак головний персонаж має розплатитися з боргами головної героїні.', 'Chainsaw Man 1 season1.jpg', 'https://www.youtube.com/embed/v4yLeNt-kCU'),
(25, 'Нова ера – Євангеліон 1 сезон', 'serial', 'Через п\'ятнадцять років від дня світової катастрофи, яка змінила життя на землі, знищивши безліч людей, виживших починають атакувати «Ангели», моторошні, неймовірних розмірів істоти, що з\'явилися для проведення випробувань на виносливість. ', 'fgh1.jpeg', 'https://www.youtube.com/embed/13nSISwxrY4'),
(29, 'Людина-бензопила 1 сезон', 'shortly', 'Головний персонаж Дендзі завжди мріяв про спокійне і розмірене життя, яке б приносило задоволення. Ці мрії мали втілитись у житті з коханою дівчиною. Однак головний персонаж має розплатитися з боргами головної героїні.', 'Chainsaw Man 1 season1.jpg', 'https://www.youtube.com/embed/v4yLeNt-kCU'),
(31, 'Меню', 'novelty', 'У відкритому океані розташувався дивовижний острів. Побувати на ньому бажають туристи з усієї планети. Щоправда вабить їх не мальовнича природа чи кришталево чисті води. ', 'The Menu1.jpg', 'https://www.youtube.com/embed/Kx55Rkynhtk'),
(33, 'Кіт у чоботях 2: Останнє бажання', 'novelty', 'Природа наділила його красою, хитрістю та неймовірною чарівністю. Він носить чорний капелюх та високі чоботи. Те, як він володіє шпагою і його невимовна відвага, завжди звертають на себе загальну увагу, а вороги втікають з поля битви. ', 'Puss in Boots The Last Wish1.jpg', 'https://www.youtube.com/embed/tHb7WlgyaUc'),
(34, 'Аватар: Шлях води', 'novelty', 'Сюжет 2 частини розкаже нам про головних героїв — Джейка та Нейтирі, які встигли створити свою сім\'ю та старанно виховують дітей. Тепер вже велике сімейство приймає в свою родину ще одну дитину, яка народилася на військовій базі планети Пандора.', 'he Way of Water1.jpg', 'https://www.youtube.com/embed/d9MyW72ELq0'),
(35, 'Проєкт «Адам»', 'novelty', 'На початку ХІХ століття одному з університетів відбувається страшний випадок. Студент виявлений повішеним. Хоча тут цей факт недивний. Ніхто з місцевих детективів не береться за таку просту справу. Невдовзі з\'ясовується, що у покійного вирізане серце. ', 'The Pale Blue Eye1.jpg', 'https://www.youtube.com/embed/ddbL9jvg77w'),
(36, 'Дамер - Чудовисько: Історія Джеффрі Дамера', 'shortly', 'Події серіалу розгортаються у сімдесят восьмому році. Точніше, це лише початок історії. Уся серія злочинів Дамера Джеффрі тягнеться аж до дев\'яносто першого року минулого сторіччя.', 'Dahmer1.jpg', 'https://www.youtube.com/embed/NVHHs-xllqo'),
(37, 'Казино 1 сезон', 'shortly', 'Серіал \"Казино\" пропонує поринути у нову історію, створену генієм режисерської справи з Південної Кореї, автора знаменитого бойовика \"Кримінальне місто\". Кан Юн Сон вкотре пропонує нам поринути в гостросюжетну круто закручену кримінальну історію. ', 'Kajino 1.jpg', 'https://www.youtube.com/embed/pLyM5KaessI'),
(38, 'Базіка 1 сезон', 'shortly', 'Навколо відбувається щось незрозуміле та по-справжньому дивне. Третьосортний адвокат випадково береться за справу, яка може миттєво підняти її в рейтингах і зробити найбажанішим експертом у юридичній сфері', 'Big Mouth1.jpg', 'https://www.youtube.com/embed/Z3OMssCwMjA'),
(39, 'Нова ера – Євангеліон 1 сезон', 'random', 'Через п\'ятнадцять років від дня світової катастрофи, яка змінила життя на землі, знищивши безліч людей, виживших починають атакувати «Ангели», моторошні, неймовірних розмірів істоти, що з\'явилися для проведення випробувань на виносливість.', 'Genesis 1.jpg', 'https://www.youtube.com/embed/13nSISwxrY4'),
(40, 'Родина Адамсів', 'random', 'Уявіть сім\'ю, в якій батько любить прогулянки під гуркіт грому і блиск грози, а для мами немає кольору привабливішого, ніж чорний. Діти весь вільний час проводять на кладовищі, граючи з кістками, а бабуся регулярно приймає отруту перед сном.', 'The Addams Family1.jpg', 'https://www.youtube.com/embed/F7Ug863S8dQ'),
(41, 'Демонік', 'random', 'Надприродний хорор про нові технології, які приходять на допомогу екзорцистам. Дочці серійної вбивці належить заглянути у підсвідомість власної матері, щоб зрозуміти, що штовхнуло її на жорстокі злочини.', 'Demonic1.jpg', 'https://www.youtube.com/embed/EYXLKC5xd7Q'),
(42, 'Вікінґи. Вальгалла 1 сезон', 'random', 'Серіал охоплює цілу епоху, що сталася в ранньому середньовіччі, коли вікінги активно відвідували острови Великобританії з метою захоплення нових земель та пограбування. Щоправда, окрім іншого тут сталося чимало інших цікавих подій', 'Vikings1.jpg', 'https://www.youtube.com/embed/Yi4YnwFT7Gk');

-- --------------------------------------------------------

--
-- Структура таблицы `users`
--

CREATE TABLE `users` (
  `user_id` int(11) NOT NULL,
  `user_name` varchar(100) NOT NULL,
  `user_email` varchar(100) NOT NULL,
  `user_password` varchar(100) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- Дамп данных таблицы `users`
--

INSERT INTO `users` (`user_id`, `user_name`, `user_email`, `user_password`) VALUES
(1, 'aa', '@mail.com', '4693fbb215b8ca15a6900f0cfa164cdc'),
(2, 'vvvvvv', 'vvvvvv@mail.com', 'e10adc3949ba59abbe56e057f20f883e'),
(3, 'nnnnnn', 'nnnnnn@nn', '4c8b40018f893d4384fcfe60302cb46a'),
(4, 'hhh', 'hhh@hhh', '111111'),
(5, 'fff', 'fff@gmail.com', '96e79218965eb72c92a549dd5a330112'),
(6, 'xxx', 'xxx@ukr.net', 'e3ceb5881a0a1fdaad01296d7554868d');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `admins`
--
ALTER TABLE `admins`
  ADD PRIMARY KEY (`admin_id`);

--
-- Индексы таблицы `products`
--
ALTER TABLE `products`
  ADD PRIMARY KEY (`product_id`);

--
-- Индексы таблицы `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`user_id`),
  ADD UNIQUE KEY `UX_Constraint` (`user_email`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `admins`
--
ALTER TABLE `admins`
  MODIFY `admin_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT для таблицы `products`
--
ALTER TABLE `products`
  MODIFY `product_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=43;

--
-- AUTO_INCREMENT для таблицы `users`
--
ALTER TABLE `users`
  MODIFY `user_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
